{"What's The Word For When Your Government Does Something That Makes You Want To Vomit?": "", "Supreme Court: ‘Racism Is Pretty Much Over, Right?'": "", "One Guy With A Marker Just Made The Global Warming Debate Completely Obsolete": "", "If You Look A Little Closer, These People Might Surprise You": "", "That A+ Moment When A Comedian Calls Out Outdated Racist And Gay Jokes During A Roast": "", "The World Was Supposed To End December 21. These People Had Other Plans.": "", "If Intersectionality Had A YouTube Account, This Would Probably Be Its First Post": "", "This Man Tells A Senate Subcommittee About Al-Qaeda's Best Recruiting Technique. It Will Shock You.": "", "2 Million Women Are Suffering And We Are Too Embarrassed To Talk About It": "", "If The NRA Knew The Truth About Ronald Reagan, They Probably Wouldn't Invoke His Name So Much": "", "Brazil Just Became The Least Terrifying Place For A Child To Have Chemotherapy": "", "What Is It To Be Free? If You Had To Make His Heartbreaking Choices, You'd Still Be Asking.": "", "Last I Checked The Bible Doesn't Say Anything About Memorizing Trivial Quotes. It Does Say This.": "", "Does Everyone Think You’re Weird? Show Them This And They’ll Understand.": "", "The Crazy Reason Fewer Americans Are Adopting": "", "How An Obsolete Law Is Trying To Keep This Military Couple Apart": "", "Remember These Facts The Next Time You Sleep In On A Saturday": "", "The One Totally Stupid Thing That Will Decide The Fate Of Our Entire Economy": "", "The Kind Of Advice That Usually Costs $250 An Hour": "", "How To Eat To Live Instead Of Living To Overeat": "", "Congressman Responds Like Real Human Person Would After Getting An Absurd Letter From His Co-Workers": "", "These People Defend 'Criminals' And Sleep Pretty Well At Night. As Well They Should.": "", "A Tiny Little Nuisance That’s Responsible For Life As We Know It": "", "How The Hell Does The Bottle Cap Get IN THERE?": "", "Taylor Swift's New Song About Feminism Is Pretty Catchy (And Blunt)": "", "Gabby Giffords Says More In Her Struggle With 13 Sentences Than Most People Do In A Lifetime": "", "Talk About Brave: Most People Would Have Run For The Hills, But These Medics Shine Under Pressure": "", "There's Something Shocking That Your Boss Can Do To You In Michigan And 33 Other States": "", "See The Scientific Accident That May Change The World (Or At Least Your Battery Life)": "", "Why Wearing A Fanny Pack Is Not Even Close To The Most Embarrassing Thing A Tourist Can Do": "", "The Argument Against The Stop-And-Frisk Policy Gets An Upgrade Courtesy Of A Hip-Hop Icon": "", "That Awkward Moment When You Realize America Is Way More Sexist Than You Could Have Imagined": "", "Watch A Student Totally Nail Something About Women That I've Been Trying To Articulate For 37 Years": "", "The Cartoonish Joke That Is The Government Shutdown Explained In Less Than 4 Minutes": "", "A Bunch Of Happy White People Who Think They Speak For God Go To Uganda And Totally Misrepresent Him": "", "Remember How Shocking It Was When Ellen Came Out On TV? Look How Far We’ve Come Since Then.": "", "10 Reasons Why Global Warming Is A BIG FAKE": "", "Stephen Fry Takes A Firm Stance On Grammar. He Doesn't Go The Way You'd Think.": "", "The Truth About Angry Feminists": "", "The Coke Ad That Could Destroy All Other Products, Especially Coke": "", "See This 'Daily Show' Reporter Lose His Cool When He's Confronted With Stupidity, Naturally": "", "The Scientific Reality That's Completely Sobering And Totally Empowering At The Same Time": "", "Are You Kidding Me, America? How Is This Even Still An Issue?": "", "The Worst Online Dating Site In The History Of The World": "", "OMG! Look What Boston Marathon Runners Just Did.": "", "With All The Junk Food Judgment We Pass Around, Ronald McDonald Is Still Making A Killing": "", "Watch This Family Sweetly And Lovingly Totally Destroy One Of The Worst Stereotypes Of Christians": "", "Further Proof That Being Born A White Man Is A Bit Like Hitting The Lottery": "", "What Happens When Congress Needs To Use Something They Accidentally Cut Funding To?": "", "If You Were Never Bullied, You Probably Don't Understand Why This Ends Badly": "", "Why Women (And Men) Love This Picture So Much": "", "The Google Earth Revelation That Is Blowing My Mind": "", "In Case You Missed It, A Seriously Scary Thing Is Scheduled To Happen To New York City In November": "", "This Man Is Already Homeless. Now Some Idiot Has Made Him Even More Miserable.": "", "The Response He Received Spells Out A Much Bigger Problem That Hollywood Still Has": "", "I Just LOVE It When Dirtbags Get Called Out — Like This Jerk Over Here...": "", "History Books Take Note, Economics Is Definitely Not A Boys Club Anymore": "", "One Fact About Raising The Minimum Wage Is So Unbelievable, I Had To Fact-Check It Like 5 Times": "", "A Therapist Who Thinks He Can Cure Gay People Gets His Just Desserts, Care Of A Proud Gay Man": "", "Meet Danielle. She Won't Be Around For Very Long.": "", "3 Things You Can Do Instead Of Watching TV": "", "This Will Change The Way You Look At Your MP3 Player. Guaranteed.": "", "Somebody Looked At This And Thought It Was OK To Sell. What On Earth Were They Thinking?!": "", "A Classic Scene From 'It's A Wonderful Life' That Is Just As Relevant Today": "", "What These Kids Did To Those Dogs ... Eh, Just Watch. You'll Love It.": "", "These People Committed Political Suicide For Gun Control. Guess Where They're NOT From.": "", "I Once Had A Boss That Told Us, 'If You Get Fired, You're Firing Yourself'": "", "A Man Asked These Folks A Quick Question About Our Education System. The Answer Shocked Them.": "", "There's A Reason Why So Many Jocks Go Into Politics": "", "The Next Time Someone Talks About Starving Kids In Africa, Show Them This": "", "She Didn't Think The Love Of Her Life Was Romantic Enough. Then She Looked Out Her Office Window.": "", "Greenpeace Pulls Ingenious Prank On Shell At Their Own Awards Ceremony": "", "Oliver Stone Has Some Disturbing Questions He’d Like To Ask You": "", "After Telling You About Her Family, You'll Call This Girl 'Danielle The Resilient'": "", "Help! My Emotions Have Been Stirred By This Moving Tale Of Self-Discovery And Can't Get Up!": "", "A Hidden Camera Show Goes To Texas. It Did Not Expect To Find This.": "", "Normally I’d Say You Shouldn’t Steal From The Amish. But One Of Their Ideas Was Too Good To Pass Up.": "", "Guess How Much BP Spends On Oil Drilling Safety. Seriously, Just Guess.": "", "'I'm Not Saying She Deserved To Be Raped, BUT' Is Possibly The Worst Way To Begin A Sentence. Ever.": "", "These Talented Artists Said Everything By Saying Almost Nothing At All": "", "Nice Try Banning This Advert, Rupert Murdoch, But Australia Can Watch It Here Instead": "", "This Renewable Energy Idea Is So Obvious I Smacked My Face": "", "Most People Get Mad When Told They Can't Do Something. She Made A Pretty Good Point Instead.": "", "This Guy Just Won A Nobel Prize. He Has Something To Say About The USA That You Should Hear.": "", "Little Boys Learn A Lot From Watching 'Star Wars,' And It Isn't All Good": "", "Got A Minute? Watch This Girl Steal Someone's TV For A REALLY Good Reason.": "", "Only A Kid Could Write To A Homeless Shelter And Get This Great Response": "", "Here’s The Ad That Muslims Across America Wish You Would See": "", "Bernie Sanders Is Pissed, And For Good Reason": "", "Liberal, Conservative, Whatever: Here Is Something We Can Agree Ain't Right": "", "If You Told Me I'd Be Fascinated By A Comic About Being Poor, I Would Have Thought You Were Drunk": "", "The Most Sensible Definition Of Marriage I've Ever Heard": "", "The Mainstream Media Is Too Busy Covering War To Show You THIS": "", "MAP: Definitive Proof That We Don’t All Live In The Same Democracy": "", "Here’s One Minute Of Powerful Realtalk That Everyone Confused About Human Rights Should Watch": "", "Sounds Like: A Bond Villain's Evil Plot. Actually Is: America's Secret Operations In The Middle East.": "", "Would Mark Zuckerberg Have Your Back In An Internet Fistfight?": "", "Dumbledore Is Gay. Harry Potter Has This To Say.": "", "You'll Want To Pay A Tiny Bit More Taxes After Seeing This": "", "Imagine If Batman Was Mexican And He Had A Whole Lot Of Robins": "", "They May Look Ordinary, But 16 Million Kids Have A Secret. And It Hurts.": "", "Maybe The Coolest Car Commercial You'll Ever See": "", "He Made A Choice. He Took A Life. He Made Another Choice. He's Saving A Community.": "", "This Couple’s 17-Year Age Difference Is The Least Interesting Thing About Them": "", "Holy Cow! The Way This Girl Told Off Her Bullies Is Incredible.": "", "What Would You Say To Your Son If He Came Home With Nail Polish On?": "", "Westboro Baptist Church May Have Met Their Match... And She's 5 Years Old": "", "11 Kids, 11 Seconds, And 1 Mind-Blowing, Hopeful Fact About The Sandy Hook Tragedy": "", "It's Dangerous For Her To Get To School, But She's Doing It For Her Future": "", "She's Worked At McDonald's For 10 Years. She Asked Its President A Simple Question. Then Cops Came.": "", "Why Pediatricians Are The Redheaded Stepchildren Of Medicine": "", "You Can Forget One Or Two Things On The Grocery List, But You NEED To Remember This": "", "A Retired Athlete Said The Smartest Thing About Television And Race The Other Day": "", "Now If Only Every Guy Who Acted Creepy Could Be Busted On National TV Like This": "", "It's Not A Hymn For Hoodies. It's A Vivid Reminder Of The Biggest Question About This Whole Mess.": "", "People Get Tired Of Hearing The Word Awesome. But In My Defense, Seriously, This Kid Is Awesome.": "", "See One City’s Sweet Plan To Plant About A Zillion Lemon Trees. That’s A Lotta Zest.": "", "When Your Immigration Paperwork Takes 11 YEARS To Process, You Might Be A Muslim!": "", "Step 1: Ask Other Nations What They Think Of Our Health Care. Step 2: Apply Cold Water To The Burn.": "", "I'm Not Sure I Could Do What This Actress Did — In Front Of A Police Car — In A Foreign Country...": "", "A Young Boy Goes Missing And One Person Waits An Entire Lifetime For His Return": "", "Note To Justin Bieber: Here's How You Write An Unforgettable Love Song": "", "Girl On Girl: Not As Sexy As It Sounds": "", "There Are Some Who Would Stick Their Head In The Sand Rather Than Work For Change. Not This Guy.": "", "Our Economy Is A Game — And Here's How We've Been Playing By The Wrong Set Of Instructions": "", "This Is What Happens When A Congressman Joins With Fast Food Workers To Make Some Change": "", "Anyone Could Make This Mistake. The Fact It Happens All The Time Is Frightening.": "", "CNN Anchor Brilliantly Tricks Her Sexist Guest Into Accidentally Endorsing Racism On Live TV": "", "Why're We Afraid To Talk Religion And Politics Over Dinner But Oddly Cool With This Offhand Mention?": "", "National Park Service Workers Tell The Truth About The Shutdown, And It's Haunting": "", "The Secrets A Teen Carried Nearly Killed Her, So She Did The Only Thing She Could With Them": "", "Ban Ki-moon Says Something About Ladies That We Already Planned On Doing": "", "This Is One Woman No Man (Or Building) Will Mess With Again": "", "Doctors Told Sam He Had Until He Was 13. It's Almost His Birthday. Here’s How He's Fighting.": "", "I've Met Babies Named Hennessy Before, So Why Did This Judge Just Order This Kid's Name Changed?": "", "This Pleasantly Surprising Commercial From Australia Has A Twist That Will Make You Think": "", "Watch A Jerktacular U.S. Immigration Officer Deport A Lady He Probably Shouldn't Be Deporting. EVER.": "", "This Kid's Logic Will Make You ​​Delete 'Candy Crush' From Your Phone And Hand Over Your Socks": "", "It's Crazy How Just One Heckler Encouraged So Many People To Help Out This Stranger": "", "Think That Pat-Down At The Airport Was Random? You May Have Googled One Of These Arbitrary 6 Words.": "", "So Let's Have It — Are You Team Elephant Or Team Hummingbird?": "", "The One Where A Creationist Picks A Fight And Loses To A Priest": "", "Meet The Horrifying Demon That Has Crept Into Our School System": "", "No Job, No Money, No Problem: This Restaurant Is Happy To Serve You": "", "Great. How Has The Government Lost Track Of $60 Billion This Time??": "", "When Terror Struck America, This Gay Couple Responded Heroically. Twice.": "", "How Could A Group Of College Kids Do This To An Incoming Freshman? Because They're Geniuses.": "", "These Are Literally The Smallest Apartments You'll Ever See": "", "Short And Bitter: Racism's Catch-22 Explained In 2 Sentences": "", "His Dad Beat His Mom. He Tried To Stop Him. But He Was Only 5. So He's Speaking Out Now.": "", "These Homophobic Signs Just Got Pretty Gay": "", "Mr. President, I'm Not Mad. I'm Just Disappointed.": "", "The Most Offensive Non-Offensive Joke In The World": "", "Ever Wonder What A Double Standard Within A Double Standard Looks Like?": "", "My Father-In-Law Says We Should Not Bail Out Detroit. I Think I'll Send Him This.": "", "Some Jerks Freaked Out About A Gay NBA Player, So The President And The Internet Responded Like This": "", "Sometimes A Joke About A Serious Topic Is So On Point You Have To Applaud It": "", "Genius Inventor Close To Cracking The Secret Of Trees To Harness Solar Power. Oh, And He’s 13.": "", "This Is What Happens When Your Insurance Company Rejects You, But Your Friends Don’t": "", "When You Have Common Sense Like This Guy, Who Needs To Argue With Homophobes?": "", "What You Don’t Know About Wall Street Is Exactly What’s Wrong With It": "", "BULL'S-EYE: Geena Davis Tells Hollywood Where To Stick Its Ageist, Sexist Representations Of Women": "", "She Did Everything She Was Supposed To Do. The Least These Cops Could Do Is Show Some Sympathy.": "", "If You Hadn't Heard Of This Little Girl Either, Ask Yourself Why That Is": "", "In Case You Missed It, Here's When It's OK For Boys To Play With Dolls And Girls To Play With Cars": "", "NOT A GOOD LOOK: A Notoriously Loudmouth Celeb All Of A Sudden Goes Silent": "", "They Are Human Beings Trying To Survive. Why Do Some People Have Trouble Seeing That?": "", "Scientists Discover One Of The Greatest Contributing Factors To Happiness — You'll Thank Me Later": "", "What’s The Most Quietly Despised One-Fifth Of America Nobody’s Talking About?": "", "Close Your Eyes And Imagine Your Favorite Meal. Then Open Your Eyes To This.": "", "This Is Not An Acceptable Solution To Child Abuse": "", "A Guy Gets An Ovation For Playing 'Chopsticks.' The Internet Stares In Amazement.": "", "A Congressman Throws A Temper Tantrum At A Science Fair — It's Cool, You Didn't Vote For Him": "", "Patton Oswalt's Much-Needed Love Letter To Boston And The Rest Of Humanity": "", "Compassion And Empathy Are Nice And All But Sometimes They Don't Do A Thing": "", "This Is What Happens When Bigots Put Ads On Buses": "", "A Television Journalist Loses His Cool And Confronts Someone Responsible For The Shutdown": "", "This Old White Guy Says Keeping Our Women Safe Is Unconstitutional": "", "Seeing A Woman Say Things Like This About Other Women… You Bet I Get The Warm 'N' Fuzzies": "", "If You Enjoy When Rich Corporations Fail, You’ll Love This Chart": "", "WTF New York? No One Should Ever, EVER Make Art Like This.": "", "How Al Gore Could Have Won The 2000 Presidential Election With Ease": "", "Your Yogurt Has More Sugar Than A Coke (And Some Other Sneaky Food Stuff You Didn’t Know)": "", "A Hollywood Star Was Accused Of A Crime He Didn't Commit. Here's Why.": "", "Watch A Musician Give The Coolest Science Lecture This Side Of Anywhere": "", "I’ve Never Had A Pie Chart Make Me Gasp Before": "", "1 Key Difference Between Being Gay And Trying To Poison Your Neighbor’s Cat": "", "Representative Brian Sims Brings The House Down With A Single Sentence About Abortion": "", "What They're Trying To Do To This Man Is Rough, But What He Says At The End Is Devastating": "", "The Punishment For Blowing The Whistle On Government Corruption Is Horrific": "", "Why Does The World Keep Screaming At These Space-Traveling Little Creatures?": "", "You Won’t Believe What This Guy Does In His Spare Time": "", "He Has No Legs. His Best Friend Is Blind. Together, They Win At Everything They Set Their Minds To.": "", "It's Rare That The Daily Show Slips Out Of Satire And Into Anger. This Is One Of Those Times.": "", "A City Council Meeting Gets Bombed, But You've Never Heard Of The City": "", "Here's How A Liberal Mom Reacts When Her Young Daughter Says Her Lesbian Grandmas Can’t Get Married": "", "The Most Dangerous Sea Creatures In The World Are On This Graphic": "", "A Photographer Persuades Strangers To Do Something Really Odd, And They Totally Love It": "", "Just A Few Good Reasons Why Men Probably Shouldn't Be Allowed To Vote": "", "Here's How Immigration Works, And I Still Don't Get It": "", "If Your Friends Are Using This 3-Letter Word, You May Need To Stage An Intervention": "", "The Warning Label That We Never Knew We Needed Until We Saw It": "", "Oprah Tells An Atheist She Believes In God. The Atheist Responds Like A Christian. Or Any Human.": "", "When You Add Up These 3 Numbers, You Don't Get A Sum — You Get A Disaster": "", "One Conspiracy Theory That's Actually Worth Your Time": "", "This Filmmaker Could Have Been Killed At Any Moment, But He Kept The Camera Rolling Anyway": "", "Don’t Be Distracted By The Wondrous British Accents. Just Listen To These Two Words.": "", "Watch A Diner Waitress Explain To A Wall Street Guy How Money Works In America": "", "Folks Are Mad At A Famous Actress For Taking Care Of Herself. You Won't Believe Why.": "", "A Father Reprimands His Homophobic Child In This Beautiful Letter": "", "It's Important To Remember How Bad Governments USED To Be": "", "'Terminator' Cyborg Technology Has Arrived: The Most Advanced Prosthetic Limb Ever Created": "", "If Immigrants Terrify You, Then Here's 3 Simple Facts To Calm Your Frightened Brain": "", "This Famous Actress Was A Teenage Feminist And Proud Of It": "", "America Put This Famous Gay Space Dude In Jail When He Was 5 Years Old. Now He's Going Where?": "", "KAPOW: Oprah Just Bit The Head Off Of The Anti-Gay-Marriage Bat": "", "Exactly How Gay Is Your State?": "", "Three Teenage Girls Have A Question For One Brilliant Comedian. No One's Disappointed.": "", "A News Team Risked Their Lives To Uncover This Story. They Wanted You To See The Horror Yourself.": "", "If Boy Scouts Are Taught To ‘Always Be Prepared,’ Then Why Weren’t They Prepared For The Future?": "", "The Real Cost Of The Tea Party's Shenanigans In One Horrifying Graphic": "", "See How A Bunch Of Students Got Vaginas Banned At Their University": "", "I'd Ask You To Like This Photo, But Then I Think That Proves The Photo Right": "", "New York And California Are Conspicuously Absent From One Ranking Of Coolness": "", "A Police Officer Gets Fired For Exactly The Wrong Reason": "", "Conan O'Brien Does Some Investigative Journalism. The Result Is Hilarious.": "", "Disney Just Pissed Off The Wrong Group Of People": "", "A Famous Actor Dies And Leaves Behind This Important Message I’d Never Seen Before": "", "You Won't Believe This Video Was Shot In America": "", "Mesmerizing Photographs Of Soldiers' Faces Before And After A War": "", "An Awful Corporation Does Something So Cartoonishly Creepy That We Have To Make A Dr. Evil Reference": "", "Pinch Me! I Must Be Dreaming: Whole Foods Is Putting A Farm Inside Its Store?": "", "Elizabeth Warren Asks The Most Obvious Question Ever And Stumps A Bunch Of Bank Regulators": "", "The Most Beautiful-Sounding Middle Finger To Islamist Rebels I've Ever Heard": "", "She's Not Just Destined For Greatness, She's Destined To Do Great Things For Women": "", "These Kids Are So Excited About Math That It's Almost Like They Forgot They're In School": "", "Why We Need More Adult Films In Theaters": "", "See The Teacher’s Resignation Video That 280,000 People Have Already Watched": "", "You Know How People Say Everyone In America Should Speak English? How About This American Language?": "", "Colin Powell's Quote About Gay Marriage Is Chock-Full Of Common Sense And Decency": "", "This Is What Happens To Straight Kids When Gay People Get Married?": "", "There Is Something So Satisfying About Watching 'The Daily Show' Nail This Outrageous Hypocrisy": "", "And This Is How A Great Rap Artist Responds To Hip Hop's Obsession With Degrading Women": "", "I Love You, America, But This List Should NOT Make You Uncomfortable": "", "This Is Literally Just A Video Of A Bunch Of Super Happy People. Watch It And TRY Not To Smile.": "", "'I've Got Nothing To Hide' Is The Wrong Reaction To Have To The NSA Scandal. Here's Why.": "", "One Country's Plan To Save Unwanted Dogs Is Pure Genius": "", "A Head-Slappingly Simple Strategy That Might Just Reduce The Crime Rate": "", "Meet Anthony. He’s About To Educate Us On One Of The Most Perplexing And Obvious Signs Of Autism.": "", "Which Classic American TV Show Totally Predicted This Gay News 42 Years Ago?": "", "Watch A Bunch Of Kids Repeat The Ignorant Garbage They Learned In School": "", "Maybe The Most Awkward Black History Month Celebration Ever": "", "A Lobbyist And A Senator Walk Into A Restaurant. See What Happens Next.": "", "Watch And Learn: How To Roll Down Your Window And Deliver A Fantastic Response To An A**hole": "", "A Woman Who Struggles To Speak Tells You A Story That’ll Rock Your World": "", "Here’s The Secret Behind All Your Actions That I’m Betting You’re Too Afraid To Watch": "", "You Don't Have To Wear A Fedora, But You DO Have To Be A Decent Human Being": "", "Cancer-Surviving Comic Fails To Make Her Point. Hilarious.": "", "I Wouldn't Mind Getting Sent To This Principal's Office": "", "Desmond Tutu Delivers One Kick-Ass Line Against Anyone Advocating For A Homophobic God": "", "After Seeing These Prices, I Might Think Twice Before I Complain About My Own Phone Bill": "", "What Being 'One Of THOSE Girls' Means In America Today": "", "Here's Beautiful Proof That We Don't Always Get The 'Be A Good Person' Thing Right The First Time": "", "We're Teaching Kids History, But We're Leaving This Entire Bit Out?": "", "This Father's Love For His Kids Is Beautiful. What Happened To Him Has Me Embarrassed As An American.": "", "I Went Looking For A Serious Discussion About Gun Safety, And All I Got Was This Video": "", "WTF? McDonald's Figured Out Another Way To Screw Its Own Employees.": "", "The People Who Approved These Ads Have A Lot Of Explaining To Do": "", "The 3 Little Words That Could Help Keep Your Loved Ones Alive": "", "CHART: Why Nearly Half Of Today's Kids Won't Be Able To Look At Their Parents' Wedding Photos": "", "A Heated Fox News Debate Over Drone Strike Policy Turns Into A Yelling Match": "", "WTF! We Could Save Lives AND Money. Tell Me Again Why This Is A Problem?": "", "Something Sickening Is Happening To Some Of Our Schoolchildren, And You Probably Have No Idea": "", "The World's Greatest Boyfriend Died At Age 18 — Then The Internet Made Him Immortal": "", "The Cops Almost Killed This Guy For Drinking At A Bar": "", "Is There Even A 'Right' Way To React When Your Dad Tells You He's Gay?": "", "The Dirty Little Secret That Fast-Food Companies Don't Want You To Know": "", "She's Fierce. She's Blunt. And Sadly, She's Also Right.": "", "For 13 Years, These Boys' Lives Were Filmed. The Result Is Better Than Any Reality Show I've Seen.": "", "The Amazing True Story Of A Guy Who Didn't Worry About Looking Normal And Became Superhuman Instead": "", "This Is Why I’m Afraid Of My Couch": "", "NAILED IT: Watch A Really Smart Comedian Destroy A Really Dumb Idea": "", "He’s Caught Lots Of Criminals In The Act; Now He Has To Hide His Face So They Won't Catch Him": "", "One Of The World’s Most Hated Groups Found Her, Took Her Money, And Left Her In Tears (Of Happiness)": "", "Even If You're A Fan Of The Tea Party, This Will Make You Laugh": "", "9 Out Of 10 Americans Are Completely Wrong About This Mind-Blowing Fact": "", "What An Orangutan Says To This Little Girl Is A Message We All Need To Know About": "", "Why Ringing A Doorbell Could Save Someone's Life": "", "A Woman With A Great Mind Asks You To Take A Moment To Appreciate Her Body": "", "What Goes Through A Soldier’s Mind During An Attack? Might Not Be What You Expect.": "", "The Most Racially Intolerant Place In The Country Is Not Where You Think It Is": "", "Simplest Description of PTSD Ever Told In 2 And Half Minutes": "", "Why Is This Artist Telling You To Throw Away Your Phone? And So Beautifully?": "", "What's Costing America More Than War, Education, And Credit Card Debt?": "", "These Wonderful People Share Secrets That Are Killing Them. This Could Change Your Life.": "", "You Think I Should Move To Canada If I Don't Like It Here? No Way. That Place Is Scary.": "", "The Female Body Part That Wasn't Discovered (For Real) Until 1998": "", "Holy Crap! Am I The Only One Who Thinks My Lunch Should Be Worth More Than Where It Came From?": "", "This Adorable Kid Just Wants To Take A Girl On A Date. So Why Is That Such A Big Deal?": "", "The Way We've Been Talking About Gettin' It On Is Turnin' Me Off": ""}