{"Ellen’s Tragic Lesbian Love Story Has The Most Beautiful Ending": "", "If You Listen To What These New Yorkers Say And Are Not Angry, You Live In Another World From Me": "", "If Boy Scouts Are Taught To ‘Always Be Prepared,’ Then Why Weren’t They Prepared For The Future?": "", "This Man Tells A Senate Subcommittee About Al-Qaeda's Best Recruiting Technique. It Will Shock You.": "", "Sigh. Elizabeth Warren Embarrasses Some Bank Regulators To Their Faces. Again.": "", "If We Had More Drones, People Wouldn’t Get Away With Stuff Like This. That's Not A Good Thing.": "", "How An Obsolete Law Is Trying To Keep This Military Couple Apart": "", "Remember These Facts The Next Time You Sleep In On A Saturday": "", "You Should Watch This Strange Man Rub A Stick Of Butter On A Tree. For A Really Good Reason.": "", "The One Totally Stupid Thing That Will Decide The Fate Of Our Entire Economy": "", "Listen To These People Talk About Living On The Edge And Then Tell Me Why We Can't Change Things": "", "They Are Human Beings Trying To Survive. Why Do Some People Have Trouble Seeing That?": "", "These People Defend 'Criminals' And Sleep Pretty Well At Night. As Well They Should.": "", "I Challenge You Not To Smile When You See What This Little Girl Is Doing": "", "Your Next Computer Will Be Able To Smell You (And 37 Other Pretty Solid Predictions About The Future)": "", "There's Something Shocking That Your Boss Can Do To You In Michigan And 33 Other States": "", "Meet The Wannabe New Barbie, No Longer Burdened With Those Unattainable Alien-Like Legs": "", "You See That? That's The Sweet Sight Of People Holding Politicians Accountable.": "", "A Bunch Of Happy White People Who Think They Speak For God Go To Uganda And Totally Misrepresent Him": "", "The Coke Ad That Could Destroy All Other Products, Especially Coke": "", "See This 'Daily Show' Reporter Lose His Cool When He's Confronted With Stupidity, Naturally": "", "I Bet A Lot More People Would Become Librarians If They Got To Do It Like This": "", "BOOM: 'The Daily Show' Puts Another Debate To Rest": "", "Hello, Africa. Have You Picked Yourself Up Off The Floor Yet?": "", "People Like These Are Usually Ignored When Others Pass Them By. I Dare You To Ignore Them Now.": "", "I Just LOVE It When Dirtbags Get Called Out — Like This Jerk Over Here...": "", "If You're Curious What Neil deGrasse Tyson Would Be Like As Your Dad, Watch His Graduation Speech": "", "The Wheels On The Bus Come To A Screeching, Jolting Halt": "", "One Fact About Raising The Minimum Wage Is So Unbelievable, I Had To Fact-Check It Like 5 Times": "", "I Want All Girls To Play This As Their Motivational Music For School Every Morning": "", "The Completely Obvious Way To Solve Homelessness": "", "Somebody Looked At This And Thought It Was OK To Sell. What On Earth Were They Thinking?!": "", "Torturing Animals At These Places Isn't Illegal, But It Is Illegal To Film It": "", "Why Is CNN Getting Rid Of Its Best Journalist?": "", "¿Puedes Hablar El Lenguaje Del Amor?": "", "Last I Checked The Bible Doesn't Say Anything About Memorizing Trivial Quotes. It Does Say This.": "", "Are You Happy And In Love? Here’s Why That Makes You So Sad.": "", "He Didn't Do Anything Out Of The Ordinary, But Society Makes It Feel Like He Did": "", "Someone Online Said This Is 'Feminist Crap' — So, Of Course, Now You Need To See Why They're Wrong": "", "You Call It Being Friendly. Some Women Call It The Worst Part Of Their Day.": "", "After Telling You About Her Family, You'll Call This Girl 'Danielle The Resilient'": "", "Help! My Emotions Have Been Stirred By This Moving Tale Of Self-Discovery And Can't Get Up!": "", "You'll See Some Food In This Clip, But You'll Actually Get Food For Thought": "", "These Talented Artists Said Everything By Saying Almost Nothing At All": "", "What The End Of Your Day Would Look Like If These People Had Their Way": "", "These Ads Are Supposed To Scare You Away From Health Insurance. They'll Make You Laugh Instead.": "", "The Most Beautiful Way To Stop A Bully I've Ever Seen": "", "The Future Of America Relies On Women Doing This": "", "Did AIDS Just Get Cured By A Bunch Of Gamers?": "", "Here’s One Minute Of Powerful Realtalk That Everyone Confused About Human Rights Should Watch": "", "The Most Racially Intolerant Place In The Country Is Not Where You Think It Is": "", "Meet Catherine: Her Story Will Just About Break Your Heart": "", "They Told Her No Firm Would Pay Her Equally. So She Started Her Own.": "", "'What Do You Think A Feminist Is?' Aaaand Cue Some Of The Worst Answers Possible": "", "You'll Want To Pay A Tiny Bit More Taxes After Seeing This": "", "There's Something Odd About This 'Traditional Marriage' Propaganda Video": "", "The New Pope Just Kissed A Muslim Woman's Foot; Watch The World React": "", "Ban Ki-moon Says Something About Ladies That We Already Planned On Doing": "", "Why You Should Stop Instagramming Your Food And Start Instagramming Its Packaging": "", "Your Mom Went Through Hell For You. So The Least You Could Do Is Watch This.": "", "Something Every Teacher Should Watch. And Student. And Person.": "", "Watch A Lesbian Attack The Word 'Gay'": "", "Meet 7 Families That Will Make Your Groceries Blush": "", "Why Pediatricians Are The Redheaded Stepchildren Of Medicine": "", "Everyone Has One Great Poem Inside Them, And This Actor Just Nailed His": "", "This Is Why The 2014 World Cup Is A Bad Idea": "", "The Risk Of Drowning Has Never Looked So Appealing": "", "If This Is What It Means To Be American, Count Me In": "", "It's Not A Hymn For Hoodies. It's A Vivid Reminder Of The Biggest Question About This Whole Mess.": "", "Watch This Dude Infect People At A Bus Stop, And See If You're Susceptible": "", "Sometimes A Joke About A Serious Topic Is So On Point You Have To Applaud It": "", "When Your Immigration Paperwork Takes 11 YEARS To Process, You Might Be A Muslim!": "", "They Replaced Black People With White To Make You See This Differently. Did It Work?": "", "Scientists Discover One Of The Greatest Contributing Factors To Happiness — You'll Thank Me Later": "", "Girl On Girl: Not As Sexy As It Sounds": "", "Is The Risk Of Wearing These Worth It?": "", "I Hope You Never Have To Take Advantage Of This Law, But You Need To Know It Exists": "", "The Next Time One Of My Kids Tells Me, 'I Can't,' I'm Showing Them The Video Of What This Guy Did": "", "Why're We Afraid To Talk Religion And Politics Over Dinner But Oddly Cool With This Offhand Mention?": "", "If You're Young, This Is The Only Obamacare Infographic You Need. I Obamadare You To Click On It.": "", "Here Are A Few Lessons You Won't Find In Any Classroom": "", "This Is One Woman No Man (Or Building) Will Mess With Again": "", "Doctors Told Sam He Had Until He Was 13. It's Almost His Birthday. Here’s How He's Fighting.": "", "Congressman Responds Like Real Human Person Would After Getting An Absurd Letter From His Co-Workers": "", "Watch A Jerktacular U.S. Immigration Officer Deport A Lady He Probably Shouldn't Be Deporting. EVER.": "", "Most People Get Mad When Told They Can't Do Something. She Made A Pretty Good Point Instead.": "", "No Job, No Money, No Problem: This Restaurant Is Happy To Serve You": "", "When Terror Struck America, This Gay Couple Responded Heroically. Twice.": "", "How Could A Group Of College Kids Do This To An Incoming Freshman? Because They're Geniuses.": "", "A Pastor Asks A Politician Why He Supports Gay Marriage. It Seems He Wasn't Prepared For His Reply.": "", "2 Lesbians Went To A Macklemore Concert And This Is What They Got": "", "These Homophobic Signs Just Got Pretty Gay": "", "If These Women Are Brave Enough To Show Their Faces, We Should Be Brave Enough To Watch This Video": "", "Mr. President, I'm Not Mad. I'm Just Disappointed.": "", "One Of The Wrongest Harry Potter-Related Anti-Abortion Signs You'll Ever See": "", "This Is What Happens When Your Insurance Company Rejects You, But Your Friends Don’t": "", "What You Don’t Know About Wall Street Is Exactly What’s Wrong With It": "", "William Shatner Schools The Internet On This Newfangled Thing Called 'Being Nice'": "", "Wow, The Newest Anti-Gay-Marriage Arguments Are Getting Even Crazier": "", "Close Your Eyes And Imagine Your Favorite Meal. Then Open Your Eyes To This.": "", "There Are A Lot Of Quotes About Creativity; Here’s One That’s Actually Useful": "", "This Is What Happens When Bigots Put Ads On Buses": "", "A Famous Actor Dies And Leaves Behind This Important Message I’d Never Seen Before": "", "If You Enjoy When Rich Corporations Fail, You’ll Love This Chart": "", "A Lesbian Just Took On The U.S. Supreme Court Over Gay Marriage — And Probably Won!": "", "What Are Assault Weapons Actually Designed To Do? Let's Ask A 4-Star General.": "", "Your Yogurt Has More Sugar Than A Coke (And Some Other Sneaky Food Stuff You Didn’t Know)": "", "A Hollywood Star Was Accused Of A Crime He Didn't Commit. Here's Why.": "", "Meet The Man Who Changed What A 'Drive-By' Can Be In South Central L.A.": "", "Wow: Footage Of A 1944 Spitfire Plane Crash Seen By The 83-Year-Old Vet For The First Time": "", "Jon Stewart Pins Down The Media With Their Own Words": "", "Why Does The World Keep Screaming At These Space-Traveling Little Creatures?": "", "One Of The Highest-Paid Jobs You Can Get Out Of College Is One I've Never Even Thought Twice About": "", "How Can Our Kids Accept Diversity If These Books Are What We Use To Raise Them?": "", "A City Council Meeting Gets Bombed, But You've Never Heard Of The City": "", "Here's How A Liberal Mom Reacts When Her Young Daughter Says Her Lesbian Grandmas Can’t Get Married": "", "The Way We've Been Talking About Gettin' It On Is Turnin' Me Off": "", "The Mind-Boggling Stupidity Of The Sequester Explained In Plain English": "", "I Can Think Of 1 Or 2 CEOs That'd Ground Their Kids For Getting Near This Thing": "", "Jon Stewart Tells A Room Full Of Overachievers That Success In College Doesn't Mean Much": "", "Why You’re Being Smart For Not Liking This Little Girl": "", "The Incredible Story Of A Giant Dandelion That Could Save Thousands Of Lives": "", "You Might Not Get Their Names But You’ll Get No Better Introduction": "", "It's Important To Remember How Bad Governments USED To Be": "", "'Terminator' Cyborg Technology Has Arrived: The Most Advanced Prosthetic Limb Ever Created": "", "If Immigrants Terrify You, Then Here's 3 Simple Facts To Calm Your Frightened Brain": "", "Remember That Time A Rapist Got Convicted And The Internet Threatened To Kill The Victim For It?": "", "KAPOW: Oprah Just Bit The Head Off Of The Anti-Gay-Marriage Bat": "", "Can An Animated Movie Trailer Show How Much The Times Are Changing?": "", "A News Team Risked Their Lives To Uncover This Story. They Wanted You To See The Horror Yourself.": "", "The Mysterious Early Death Of A Sexless, One-Of-A-Kind 100-Year-Old": "", "This Supreme Court Justice Wants To Know When Bigotry Became Unconstitutional. Wait, What?": "", "See How A Bunch Of Students Got Vaginas Banned At Their University": "", "New York And California Are Conspicuously Absent From One Ranking Of Coolness": "", "This Is What Happens When A Congressman Joins With Fast Food Workers To Make Some Change": "", "A Religious Leader Tries To Tell The Wrong Woman How To Dress. Big Mistake.": "", "Seeing A Woman Say Things Like This About Other Women… You Bet I Get The Warm 'N' Fuzzies": "", "A Flash Mob That Did Way More Than Just Confuse And Startle The People Around It": "", "A Guy Gets An Ovation For Playing 'Chopsticks.' The Internet Stares In Amazement.": "", "She's Not Just Destined For Greatness, She's Destined To Do Great Things For Women": "", "If A Graffiti Artist And A History Teacher Had A Baby, It Would Be This Video": "", "Why We Need More Adult Films In Theaters": "", "What Would It Take For You To Never Use A Plastic Bottle Again?": "", "Colin Powell's Quote About Gay Marriage Is Chock-Full Of Common Sense And Decency": "", "There Is Something So Satisfying About Watching 'The Daily Show' Nail This Outrageous Hypocrisy": "", "Patton Oswalt's Much-Needed Love Letter To Boston And The Rest Of Humanity": "", "Half Of All The World’s Diseases Come From This One Substance That You Definitely Ingested Today": "", "I Love You, America, But This List Should NOT Make You Uncomfortable": "", "Watch A Diner Waitress Explain To A Wall Street Guy How Money Works In America": "", "This Is What It Looks Like When A Corporation Has A Soul": "", "POP QUIZ: Should We Blame The Parents Or The Teachers For Our Failing Schools?": "", "Which Piece Of Cake Would A Homeless Person Rather Eat?": "", "Maybe The Most Awkward Black History Month Celebration Ever": "", "Bad News For People Who Hate Obama: You May Have Been Cheering For Him This Whole Time": "", "Watch And Learn: How To Roll Down Your Window And Deliver A Fantastic Response To An A**hole": "", "A Woman Who Struggles To Speak Tells You A Story That’ll Rock Your World": "", "FLASHBACK: The Most Sexist Barbie To Ever Hit The Shelves": "", "You Don't Have To Wear A Fedora, But You DO Have To Be A Decent Human Being": "", "The Cops Almost Killed This Guy For Drinking At A Bar": "", "This Is What It Looks Like When The King Of The Nerds Gives Your Infant Daughter A Pep Talk": "", "After Seeing These Prices, I Might Think Twice Before I Complain About My Own Phone Bill": "", "We're Teaching Kids History, But We're Leaving This Entire Bit Out?": "", "Mesmerizing Photographs Of Soldiers' Faces Before And After A War": "", "The Mainstream Media Is Too Busy Covering War To Show You THIS": "", "A Kid Wipes Out On His Skateboard And The World Is WAY Better Off For It": "", "One Of The World’s Most Hated Groups Found Her, Took Her Money, And Left Her In Tears (Of Happiness)": "", "Watch The Video That Coca-Cola And McDonald's Hope You Never See": "", "At First I Thought He Was Making Fun Of Himself. Then I Realized He Was Warning Me.": "", "They Were Happily Married For 16 Years. Paid Taxes. Never Had A Parking Ticket. So We Deported Him.": "", "Your Assumptions About Sugary Foods Are About To Be Blown Away": "", "Seeing America From This Perspective Makes Me Feel Like A Total Heel": "", "Folks Are Mad At A Famous Actress For Taking Care Of Herself. You Won't Believe Why.": "", "He’s Caught Lots Of Criminals In The Act; Now He Has To Hide His Face So They Won't Catch Him": "", "Civil Rights Defenders Won This Fight In 1965. This Justice Explains How It’s Been Undone In 2013.": "", "This Filmmaker Could Have Been Killed At Any Moment, But He Kept The Camera Rolling Anyway": "", "If You Do THIS To Kids, You Will Make More Money": "", "WATCH: That Awkward Moment When Anti-Immigration Protesters Realize They're Immigrants Too": "", "What's Costing America More Than War, Education, And Credit Card Debt?": "", "That Whole 'Democracy' Thing? This Scientist Explains The Most Important Thing We Need For It.": "", "A Psychic Reveals His Greatest Trick. It's Actually Kind Of Terrifying.": "", "In Which A 'Missundaztood' Pop Star Makes Perfect Sense About The Gays And The Straights": "", "Yo Let's Put These Quotes On The Cover Of Cosmo": "", "The World Was Supposed To End December 21. These People Had Other Plans.": "", "Watch Out, No Child Left Behind, This Teenager Is Coming For You": "", "If Intersectionality Had A YouTube Account, This Would Probably Be Its First Post": "", "When Hanging Out With A 9-Year-Old Tanzanian Boy Doesn’t Look Like A Feed The Children Campaign": "", "If The NRA Knew The Truth About Ronald Reagan, They Probably Wouldn't Invoke His Name So Much": "", "The Very Games Of Thronesy History Of The Vatican": "", "These Images By One Photographer Shocked The World": "", "Does Everyone Think You’re Weird? Show Them This And They’ll Understand.": "", "A Lobbyist And A Senator Walk Into A Restaurant. See What Happens Next.": "", "That Awkward Moment When You Realize America Is Way More Sexist Than You Could Have Imagined": "", "If You Give A Kid A Book, He'll Learn A Few Things. Give A Kid This, And You’re Changing The World.": "", "How To Eat To Live Instead Of Living To Overeat": "", "You Can Forget One Or Two Things On The Grocery List, But You NEED To Remember This": "", "A Brief History Of American Inauguration Ceremonies: Keep It Simple, Stupid!": "", "Taylor Swift's New Song About Feminism Is Pretty Catchy (And Blunt)": "", "What Would Happen If The U.S. Eliminated The Penny? Let's Ask A Country That Actually Did.": "", "What If Congress Saw What It Really Feels Like To Be Us?": "", "Watch Sophia Change Blanche’s Mind About Gay Marriage In Less Than A Minute": "", "Fancy Chef Cooks Up Yummy Meals For Less Than A Dollar, And His Life Lessons Are Delish": "", "The Scientific Reality That's Completely Sobering And Totally Empowering At The Same Time": "", "Are You Kidding Me, America? How Is This Even Still An Issue?": "", "Your Unhealthy Love For Public Health In 14 Images": "", "Watch: An Astrophysicist Explode Live On Stage": "", "Why Women (And Men) Love This Picture So Much": "", "In Case You Missed It, A Seriously Scary Thing Is Scheduled To Happen To New York City In November": "", "The Response He Received Spells Out A Much Bigger Problem That Hollywood Still Has": "", "Gabby Giffords Says More In Her Struggle With 13 Sentences Than Most People Do In A Lifetime": "", "Meet Danielle. She Won't Be Around For Very Long.": "", "This Isn't The Party Of Abraham Lincoln, And It Hasn't Been For A Long Damned Time": "", "This Will Change The Way You Look At Your MP3 Player. Guaranteed.": "", "If Your Heart Is Broken For Trayvon Martin, Here Is A Small Bit Of Solace": "", "The Female Body Part That Wasn't Discovered (For Real) Until 1998": "", "The Supreme Court Did WHAT!? The Terrifying Ruling No One's Talking About.": "", "A Classic Scene From 'It's A Wonderful Life' That Is Just As Relevant Today": "", "I Once Had A Boss That Told Us, 'If You Get Fired, You're Firing Yourself'": "", "The Make-Up Tutorial Made For Both Women And Men To See": "", "Watch A Teacher Make Her 3rd-Grade Kids Hate Each Other For The Best Reason Imaginable": "", "The Difference Between Global Warming Skeptics And Normal People": "", "A Rare Candid Interview With Malcolm X In 1963": "", "My Father-In-Law Says We Should Not Bail Out Detroit. I Think I'll Send Him This.": "", "Greenpeace Pulls Ingenious Prank On Shell At Their Own Awards Ceremony": "", "How To Make An HIV Test As Normal As A Home Pregnancy Test": "", "A Hidden Camera Show Goes To Texas. It Did Not Expect To Find This.": "", "Normally I’d Say You Shouldn’t Steal From The Amish. But One Of Their Ideas Was Too Good To Pass Up.": "", "This Renewable Energy Idea Is So Obvious I Smacked My Face": "", "Got A Minute? Watch This Girl Steal Someone's TV For A REALLY Good Reason.": "", "The Key To Happiness In 30 Seconds": "", "Only A Kid Could Write To A Homeless Shelter And Get This Great Response": "", "Bernie Sanders Is Pissed, And For Good Reason": "", "'I've Got Nothing To Hide' Is The Wrong Reaction To Have To The NSA Scandal. Here's Why.": "", "Here’s The Secret Behind All Your Actions That I’m Betting You’re Too Afraid To Watch": "", "WTF? McDonald's Figured Out Another Way To Screw Its Own Employees.": "", "America Put This Famous Gay Space Dude In Jail When He Was 5 Years Old. Now He's Going Where?": "", "Sounds Like: A Bond Villain's Evil Plot. Actually Is: America's Secret Operations In The Middle East.": "", "The Punishment For Blowing The Whistle On Government Corruption Is Horrific": "", "These Parents Are Modeling Tolerance For Their Children, Just Like We All Should": "", "Here's Some Retro Advertising That Makes A Lot More Sense For Kids Than What's Around Today": "", "When You Add Up These 3 Numbers, You Don't Get A Sum — You Get A Disaster": "", "The World's Greatest Boyfriend Died At Age 18 — Then The Internet Made Him Immortal": "", "I Can Guarantee That In 1 Minute Your Respect For This Kid Will Multiply": "", "What Advice Could Make A Locker Room Full Of Football Players So Emotional?": "", "Beyoncé Makes Her Interviewer Uncomfortable In The Best Way. He Handles It Like A Champ.": "", "Ohhhh, So THIS Is What A Grown-Up Government’s Supposed To Look Like": "", "Think Seeing A Little Male Nudity On TV Is Too Explicit? Then ... It's Time To Hear The Hard Truth.": "", "There Are Some Who Would Stick Their Head In The Sand Rather Than Work For Change. Not This Guy.": "", "This Elementary School Was Horrible To A Little Girl. What The Court Did About It Was Wonderful.": "", "Watch The Best TV Show Ever Destroy American Educational Policy In Less Than 2 Minutes": "", "Step 1: Ask Other Nations What They Think Of Our Health Care. Step 2: Apply Cold Water To The Burn.": "", "Why Is The Middle Class Disappearing? Here Are Some Clues.": "", "Note To Justin Bieber: Here's How You Write An Unforgettable Love Song": "", "Everything You Know That’s Wrong With The News": "", "Oh SNAP! How 23 Words From One Female Senator Silenced A Room Full Of Anti-Choicers.": "", "CNN Anchor Brilliantly Tricks Her Sexist Guest Into Accidentally Endorsing Racism On Live TV": "", "I've Met Babies Named Hennessy Before, So Why Did This Judge Just Order This Kid's Name Changed?": "", "A Prison Ignored The Most Obvious Cries For Help, And The Result Is Devastating": "", "It's Crazy How Just One Heckler Encouraged So Many People To Help Out This Stranger": "", "This Sneak Attack Reveals Some Scary Things About Facebook": "", "It's Not One Of Those Fancy Graphing Calculators, But It Could Save Your Behind One Day": "", "Martin Luther King Jr. Had An Amazing Way With Words. Here's A Powerful Example That's Rarely Seen.": "", "Those BILLIONAIRES Were Pretty Slick With Their Crude LIE, And We're Too Thick To Notice": "", "This Parody Of Fox News Is Actually More Responsible About Fact-Checking Than The Real Fox News": "", "If You Know Any Women, You Should Probably Look At This": "", "3 Things You Can Do Instead Of Watching TV": "", "When They Called Him A Terrorist And Broke His Jaw, I Bet They Didn't Expect This Response": "", "Imagine Wanting To Kill Everything That Lives In The Ocean. Now That Dream Is A Reality.": "", "She Didn't Think The Love Of Her Life Was Romantic Enough. Then She Looked Out Her Office Window.": "", "14 Things That Are Scarier Than Putting A Needle In Your Arm": "", "I’d Like A Bag Of Fries, A Coke, And This Massive Injustice Sorted Out By The Time I Pick It Up": "", "BULL'S-EYE: Geena Davis Tells Hollywood Where To Stick Its Ageist, Sexist Representations Of Women": "", "Are Americans Losing Their Minds? Apparently, Yes.": "", "What Do The First 1,000 Days Of A Child's Life Have To Do With Anything?": "", "If You've Ever Wondered What Happens To Kids After They're Rescued From Sex Trafficking, Watch This": "", "Fox Gets Brutally Shamed On Live Television By One Of Their Favorite Guests. Whoa.": "", "42 Experimental And Mind-Bending Maps That You Won't See In Textbooks": "", "The Worst Online Dating Site In The History Of The World": "", "Grab Your Kleenex, Pull Up A Chair, And Be Prepared To Be Inspired By This 9-Year-Old": "", "A Man Asked These Folks A Quick Question About Our Education System. The Answer Shocked Them.": "", "Why Is This Artist Telling You To Throw Away Your Phone? And So Beautifully?": "", "You Won’t Believe What This Guy Does In His Spare Time": "", "He Has No Legs. His Best Friend Is Blind. Together, They Win At Everything They Set Their Minds To.": "", "The Most Dangerous Sea Creatures In The World Are On This Graphic": "", "Just A Few Good Reasons Why Men Probably Shouldn't Be Allowed To Vote": "", "This Guy Just Won A Nobel Prize. He Has Something To Say About The USA That You Should Hear.": "", "Oprah Tells An Atheist She Believes In God. The Atheist Responds Like A Christian. Or Any Human.": "", "A Congressman Throws A Temper Tantrum At A Science Fair — It's Cool, You Didn't Vote For Him": "", "This Old White Guy Says Keeping Our Women Safe Is Unconstitutional": "", "This Famous Actress Was A Teenage Feminist And Proud Of It": "", "Check Out How These Guys Are Using Straight-Up Spy Tactics For The Earth": "", "Exactly How Gay Is Your State?": "", "This Kid's Body Is A Nightmare. Thankfully, He Has His Epic Sense Of Humor To Keep Him Awake.": "", "A Congressman Decided To Insult A 4-Star General And Then Tried To Walk Out. HAHAHA.": "", "Anyone In Your Life Acting A Bit Too Self-Important? Show Them This Graph.": "", "I'd Ask You To Like This Photo, But Then I Think That Proves The Photo Right": "", "I’ll Puke If One More Politician Swears The Children Are The Future, And This Infographic Is Why": "", "A Police Officer Gets Fired For Exactly The Wrong Reason": "", "The Most Beautiful-Sounding Middle Finger To Islamist Rebels I've Ever Heard": "", "See The Teacher’s Resignation Video That 280,000 People Have Already Watched": "", "The Single Greatest Gift For A Woman": "", "A Photographer Persuades Strangers To Do Something Really Odd, And They Totally Love It": "", "This Is Literally Just A Video Of A Bunch Of Super Happy People. Watch It And TRY Not To Smile.": "", "Meet 5 Women Who Took Advantage Of A Law We Should All Know More About": "", "Hey, Beautiful. (Yes, YOU!) Click Here.": "", "The Arrogance Of People Who Are Comfortable Will Never Fail To Shock Me": "", "History May Not Remember This Speech, But I Guarantee That You Will": "", "Which Classic American TV Show Totally Predicted This Gay News 42 Years Ago?": "", "If You Eat 1,000 Cows In One Sitting, Either You're A Monster Or You Just Ate McDonald's. Seriously.": "", "One Man Destroys The Need For Paper Money In A Single Interview": "", "Typical Teen, Atypical Body. Watch How She Handles That Combo.": "", "Every Teacher Should Take Down An Unruly Student This Way": "", "The Most Sensible Definition Of Marriage I've Ever Heard": "", "An Awful Tabloid Decided To Review Her Lady Parts Instead Of Her Music. So She Responded Awesomely.": "", "There Are Two Sides To Every Situation Or Choice — This Might Help You See Them More Clearly": "", "An Anti-Gay Scoutmaster Gets A Hard Life Lesson From A Straight Eagle Scout And A Gay News Anchor": "", "The Kind Of Advice That Usually Costs $250 An Hour": "", "This Showed Up In A Park Ranger's Mailbox And My Heart Melted": "", "The 3 Little Words That Could Help Keep Your Loved Ones Alive": "", "These Wonderful People Share Secrets That Are Killing Them. This Could Change Your Life.": "", "A Retired Athlete Said The Smartest Thing About Television And Race The Other Day": "", "This Guy Is Going To Show You One Of The Most Important Things You Can Teach Your Kids": "", "Check Out The Idea That's Got This Guy's Seal Of Approval": "", "Something Frozen For 21 Years Needs To Thaw Right Now": "", "Because Women Got Tired Of Bad Sex And Being Treated Like Objects": "", "The Amazing True Story Of A Guy Who Didn't Worry About Looking Normal And Became Superhuman Instead": "", "Why It Costs An Arm And A Leg To Treat An Arm And A Leg": "", "A Sandra Bullock Romantic Comedy Should Not Decide American Immigration Policy, Right?": "", "This New Zealand Politician Unleashes One Of The Funniest Gay Marriage Speeches On Record": "", "9 Out Of 10 Americans Are Completely Wrong About This Mind-Blowing Fact": "", "Why Ringing A Doorbell Could Save Someone's Life": "", "The Most Powerful People In The World Actually Believe This One Really Awful Thing": "", "This Video About Mind-Blowing Brain Theories Might Just Blow Your Mind": "", "A Very 'Shocking' 98 Seconds. That Joke (Although Terrible) Will Make WAY More Sense After Watching.": "", "Tell Everyone To Check Out This Chart While They Can Still Hear You": "", "What's The Word For When Your Government Does Something That Makes You Want To Vomit?": "", "Supreme Court: ‘Racism Is Pretty Much Over, Right?'": "", "A Bold and Beautiful Reason To Talk To Each Other In The Elevator": "", "That A+ Moment When A Comedian Calls Out Outdated Racist And Gay Jokes During A Roast": "", "How The Hell Does The Bottle Cap Get IN THERE?": "", "Watch A Student Totally Nail Something About Women That I've Been Trying To Articulate For 37 Years": "", "If You Can Read This, You're One Of The 83 People In The World Who Can": "", "2 Million Women Are Suffering And We Are Too Embarrassed To Talk About It": "", "Brazil Just Became The Least Terrifying Place For A Child To Have Chemotherapy": "", "The Incredible Inspiration One Man Gave Us In The Last Hour Of His Life": "", "Can Somebody Just Give This Guy A Million Bucks Already?": "", "The Crazy Reason Fewer Americans Are Adopting": "", "3 Guys Pull A Prank So Hard They Might Die For It": "", "He Was Asked An Arrogant Question. His Great Answer Shows The Problem With How The U.S. Functions.": "", "OMG! Look What Boston Marathon Runners Just Did.": "", "Congratulations On The Baby! Now Back To Work.": "", "The One Thing You Would Never Expect Someone To Say To The Man Who Murdered His Child": "", "America's Old Nemesis Rears Its Ugly Head": "", "Why Wearing A Fanny Pack Is Not Even Close To The Most Embarrassing Thing A Tourist Can Do": "", "If This Young Woman Was In My Fashion Magazines Growing Up, Maybe I'd Still Read Them": "", "This Is What It Looks Like When A Gay Athlete Gives Out Her Contact Info To Any Gay Kid In Need": "", "Stephen Fry Takes A Firm Stance On Grammar. He Doesn't Go The Way You'd Think.": "", "Como Decir Todo … Sin Pronunciar Ninguna Palabra": "", "Watch This Family Sweetly And Lovingly Totally Destroy One Of The Worst Stereotypes Of Christians": "", "If You Were Never Bullied, You Probably Don't Understand Why This Ends Badly": "", "Meet The Little Old Lady Who's The Living Embodiment Of 'Support Our Troops'": "", "People Turn To The Internet For Answers. Their Questions Will Make You Cry.": "", "The Google Earth Revelation That Is Blowing My Mind": "", "Did You Remember To Tip Your Server?": "", "This Pleasantly Surprising Commercial From Australia Has A Twist That Will Make You Think": "", "These Little Kids Just Threw A Water Balloon At My Heart": "", "What Do Facebook And Wal-Mart Have In Common?": "", "If You Have To Tell Your Kids This Stuff, Then You Probably Aren't A White Person": "", "No Matter What You Think About Intervening In Syria, Here’s One Voice You Should Hear Out": "", "Corporate America, Consider Yourself Schooled. You're Welcome.": "", "A Television Journalist Loses His Cool And Confronts Someone Responsible For The Shutdown": "", "Every Time A Politician Tries To Defund Planned Parenthood, I Think Of This Brave Woman": "", "The Kind Of Marriage Proposal That Makes You Want To Go Out And Fall In Lesbian Love": "", "There's A Reason Why So Many Jocks Go Into Politics": "", "This Supreme Court Justice Just Asked A Rhetorical Question That Might Tear Down Prop 8": "", "The Next Time Someone Talks About Starving Kids In Africa, Show Them This": "", "A Little Boy Inspired Marvel Comics, So They Inspired Him Right Back": "", "I Would Be Thrilled — Like You Wouldn't Believe — To See These People Out Of A Job": "", "If You Had A Chance To Help A Blind Man, Would You Do It Like This?": "", "Guess How Much BP Spends On Oil Drilling Safety. Seriously, Just Guess.": "", "'I'm Not Saying She Deserved To Be Raped, BUT' Is Possibly The Worst Way To Begin A Sentence. Ever.": "", "Why We Might Bomb Syria Is Explained Perfectly By — A Dead Comedian?": "", "This Mother And Father Are Smiling. But What She Has To Say Will Tear You Apart.": "", "You Might Want To Put The Brakes On Your Next Trip To The Fast Food Drive-Through. Here's Why.": "", "11 Kids, 11 Seconds, And 1 Mind-Blowing, Hopeful Fact About The Sandy Hook Tragedy": "", "If You Told Me I'd Be Fascinated By A Comic About Being Poor, I Would Have Thought You Were Drunk": "", "The Secret About Work Life In 20 Other Countries That Will Surprise You": "", "How The Future Might Look If We Don't Push For Gun Control": "", "MAP: Definitive Proof That We Don’t All Live In The Same Democracy": "", "Exactly What Did Apple Cost This Country By Not Paying Its Taxes?": "", "This Awesome Video Is The Closest Thing We Have To New Episodes Of 'Arrested Development' — For Now": "", "The Beer/Marijuana Commercial That Is Making People Everywhere Rethink Their Position": "", "I Would Hire Any Of These Younguns In A Heartbeat. To Be My Boss.": "", "Imagine If Batman Was Mexican And He Had A Whole Lot Of Robins": "", "A Girl Gets Attacked At School For Being STRAIGHT?!": "", "They May Look Ordinary, But 16 Million Kids Have A Secret. And It Hurts.": "", "If The Drug War Isn't Even Working For Cops, Then What's The Point?": "", "This Couple’s 17-Year Age Difference Is The Least Interesting Thing About Them": "", "Holy Cow! The Way This Girl Told Off Her Bullies Is Incredible.": "", "What Would Suburbia Look Like If It Had The Same Water Resources As Africa?": "", "I Think I’m Supposed To Be Turned On By This, But I’m Super Grossed Out Instead": "", "You Know Those Relationships That You Stay In Too Long? Yeah — Here’s Another One.": "", "Liberal, Conservative, Whatever: Here Is Something We Can Agree Ain't Right": "", "Three Teenage Girls Have A Question For One Brilliant Comedian. No One's Disappointed.": "", "She's Worked At McDonald's For 10 Years. She Asked Its President A Simple Question. Then Cops Came.": "", "The World Looks A Little Different If You've Never Known Safety": "", "A Photographer Asked People What They’d Like To Say To The World. Their Answers Will Blow You Away.": "", "Want To Watch The State Of The Union, But In A Fancier Way? We've Got Your Back.": "", "Advice From Parents On Preparing For That Horrible Day You Know Is Coming": "", "Now If Only Every Guy Who Acted Creepy Could Be Busted On National TV Like This": "", "How Often Does A Football Player Make You Cry? Depends On How Many Times You Watch This Video.": "", "People Get Tired Of Hearing The Word Awesome. But In My Defense, Seriously, This Kid Is Awesome.": "", "Stephen Fry's Bone-Crushing Final Remark In A Debate Against The Catholic Church": "", "See One City’s Sweet Plan To Plant About A Zillion Lemon Trees. That’s A Lotta Zest.": "", "There's A Good Reason This 18-Year-Old Kid Talked Back To His 'Teacher,' Walked Out, And Got An F": "", "I'm Not Sure I Could Do What This Actress Did — In Front Of A Police Car — In A Foreign Country...": "", "A Young Boy Goes Missing And One Person Waits An Entire Lifetime For His Return": "", "Sorry, We Broke You, And There’s No Legal Way To Put You Back Together": "", "Our Economy Is A Game — And Here's How We've Been Playing By The Wrong Set Of Instructions": "", "Meet The Doctor Who Thinks We've Got America's Biggest Health Problem Backward": "", "Anyone Could Make This Mistake. The Fact It Happens All The Time Is Frightening.": "", "If You Hadn't Heard Of This Little Girl Either, Ask Yourself Why That Is": "", "National Park Service Workers Tell The Truth About The Shutdown, And It's Haunting": "", "One Of America's Most Legendary Artists Goes After America's Largest Employer, From The Grave": "", "The Science Presentation That Would've Kept Me Awake In High School": "", "The Most Ingenious Way To Come Out To Your Parents In The History Of The Universe": "", "Socialized Medicine: You Keep Using That Word. I Do Not Think It Means What You Think It Means.": "", "These Are Literally The Smallest Apartments You'll Ever See": "", "How A Medieval Ghost Town Transformed Into A Self-Sustaining Ecovillage": "", "Short And Bitter: Racism's Catch-22 Explained In 2 Sentences": "", "Why The Religion Of 'Positive Thinking' Needs To Be Burned At The Stake": "", "One Of My Favorite Authors Says There's Something We Should Remove From All Classrooms": "", "Some Jerks Freaked Out About A Gay NBA Player, So The President And The Internet Responded Like This": "", "The Most Offensive Non-Offensive Joke In The World": "", "Ever Wonder What A Double Standard Within A Double Standard Looks Like?": "", "Superhuman Navigation Skills? Risky Sexual Behavior? Your Native Language Might Be To Blame.": "", "Genius Inventor Close To Cracking The Secret Of Trees To Harness Solar Power. Oh, And He’s 13.": "", "See The Scientific Accident That May Change The World (Or At Least Your Battery Life)": "", "Try NOT Wanting To Be A Better Person After Meeting This Man": "", "The Secrets A Teen Carried Nearly Killed Her, So She Did The Only Thing She Could With Them": "", "What’s This Woman Looking So Insanely Happy About?": "", "A Classist In Switzerland Just Made A Big Mistake. HUGE.": "", "If You Could Have One Wish, Would It Be More Awesome Than What These Guys Said?": "", "This Is Not An Acceptable Solution To Child Abuse": "", "The Surprising Result Of An Extra Year Of School": "", "You May Not Have Heard Of Robert Reich. His Upcoming Movie About The Middle Class Will Change That.": "", "Compassion And Empathy Are Nice And All But Sometimes They Don't Do A Thing": "", "What An Inspiration! A Woman Who's Totally Upsetting One Industry That's Usually Male.": "", "North Korea Doesn't Want You To See This, And They'll Be Really Furious If You Share It": "", "When You Hear Someone Say 'Fat,' They Have No Idea What They're Talking About": "", "When Facebook Likes Meet Real Life, Things Get ... Complicated": "", "Next Time Someone Tells You That Immigrants Are Destroying Our Country, Show Them This": "", "When The Boss Said, 'Dance For Your Day Off,' He Didn't Expect To Be Handed His Lunch": "", "WTF New York? No One Should Ever, EVER Make Art Like This.": "", "Dog Tries To Save Owner After Cops Handcuff Him. What Ensues Is Heartbreaking. (GRAPHIC CONTENT)": "", "Forget 'God-Given' Rights. In America, It's 'However-Much-Money-You-Happen-To-Have'-Given Rights.": "", "The Secret Psychology That Shopping Malls Use To Trick You Into Spending Money": "", "This Guy Sees How Dirty Our Cleaning Habits Are. Do You?": "", "I’ve Never Had A Pie Chart Make Me Gasp Before": "", "Even If You're A Fan Of The Tea Party, This Will Make You Laugh": "", "One Comedian Picks On Adele. Then Another Comedian Turns It Into A (NSFW) Teaching Moment.": "", "Why Is Every Curse Word Censored In This Ad Except 1?": "", "One Conspiracy Theory That's Actually Worth Your Time": "", "The Best Way To Explain What Scientists Do": "", "Don’t Be Distracted By The Wondrous British Accents. Just Listen To These Two Words.": "", "What's It Like To Be Caged For 4 Decades?": "", "You Think I Should Move To Canada If I Don't Like It Here? No Way. That Place Is Scary.": "", "Great. How Has The Government Lost Track Of $60 Billion This Time??": "", "In Their Yearbook, They're 'Cutest Couple,' But In My Book, They're 'Most Inspiring'": "", "This Guy Says Plants Can Change People. So What If He Plants A Garden In A Gang-Ridden Neighborhood?": "", "Pinch Me! I Must Be Dreaming: Whole Foods Is Putting A Farm Inside Its Store?": "", "If Your Friends Are Using This 3-Letter Word, You May Need To Stage An Intervention": "", "These Kids Are So Excited About Math That It's Almost Like They Forgot They're In School": "", "What's A Penis Worth? Turns Out, A Hell Of A Lot More Than You Think.": "", "Fracking Is Pretty Hard To Understand — Until It Isn't": "", "This Is What Happens To Straight Kids When Gay People Get Married?": "", "And This Is How A Great Rap Artist Responds To Hip Hop's Obsession With Degrading Women": "", "One Country's Plan To Save Unwanted Dogs Is Pure Genius": "", "6 Posters Give A Witty (And Sinister) Look At The Not-Too-Distant Future Of Our Vacations": "", "A Bunch Of Young Geniuses Just Made A Corrupt Corporation Freak Out Big Time. Time For Round Two.": "", "Something Sickening Is Happening To Some Of Our Schoolchildren, And You Probably Have No Idea": "", "You Won't Believe What This Cop Did When The Cameras Weren't Rolling": "", "Watch A Bunch Of Kids Repeat The Ignorant Garbage They Learned In School": "", "What Would You Say To Your Son If He Came Home With Nail Polish On?": "", "We Tell The World When Our Kids Get Bumps And Bruises, But Why Are We Silent If This Happens?": "", "A Politician Attacks Gay People Using Pretend Science. Real Science Corrects Him.": "", "Cancer-Surviving Comic Fails To Make Her Point. Hilarious.": "", "What Happens When Congress Needs To Use Something They Accidentally Cut Funding To?": "", "Desmond Tutu Delivers One Kick-Ass Line Against Anyone Advocating For A Homophobic God": "", "5 Statistics That I Always Keep In Mind When Talking About Race": "", "He Was In A Coma. What He Could Hear His Students Saying To Him Is Absolutely Moving.": "", "What These Kids Did To Those Dogs ... Eh, Just Watch. You'll Love It.": "", "A Heated Fox News Debate Over Drone Strike Policy Turns Into A Yelling Match": "", "Did These Words Really Come Out Of Conan's Mouth?": "", "This Guy Commanded A Battlestar For Decades, The Least You Could Do Is Hear Him Out": "", "She Did Everything She Was Supposed To Do. The Least These Cops Could Do Is Show Some Sympathy.": "", "Here's How Immigration Works, And I Still Don't Get It": "", "Here's An Anniversary That Anti-Gay Activists Would Love To Forget": "", "If You Watch One Moment From The State Of The Union, Make It This One": "", "How This Guy's Not-So-Glamorous Childhood In The Great Outdoors Turned Him Into A Glamorous Rap Star": "", "Senator Rants At Secretary Clinton, Says Something Incredibly Insensitive — And Spectacularly Wrong": "", "That One Time A CEO Said Something So Profoundly Awful And Dumb That We Had To Fact-Check His Face": "", "A Lawyer Gets Doctors To Write Prescriptions Filled By College Students. No, Really.": "", "If You Look A Little Closer, These People Might Surprise You": "", "The Piece Of U.S. Currency That's Actually Worth Less Than Nothing": "", "Holy Crap! Am I The Only One Who Thinks My Lunch Should Be Worth More Than Where It Came From?": "", "Think That Pat-Down At The Airport Was Random? You May Have Googled One Of These Arbitrary 6 Words.": "", "If The Next 10 Minutes Leave You Smiling, We'll Call This Experiment A Success": "", "The One Where A Creationist Picks A Fight And Loses To A Priest": "", "I Have Never Asked Myself This Many Questions Before Taking A Bite Of Watermelon": "", "One Guy With A Marker Just Made The Global Warming Debate Completely Obsolete": "", "If You Drink Coffee, Here's A Fact You Need To Wake Up To": "", "Here's Beautiful Proof That We Don't Always Get The 'Be A Good Person' Thing Right The First Time": "", "Taking 10 Minutes Out Of Your Day To Call An Old Friend Won't Kill You": "", "A Grandstanding Senator Decided To Tell A Cop How To Do His Job. Big Mistake.": "", "In Other Countries We Use This As Torture, But Here It's What We Do With Troubled Kids?": "", "What Is It To Be Free? If You Had To Make His Heartbreaking Choices, You'd Still Be Asking.": "", "I Wish America Could Follow The Advice On The Dollar Bill As Well As Europe Can": "", "Brown Bear, Brown Bear, What Do You See? I See A Comedian Sticking Up For Me.": "", "A Tiny Little Nuisance That’s Responsible For Life As We Know It": "", "A Simple Joke About A Super Obvious Problem In Hollywood Said In A Refreshingly Sly Way": "", "Here's Why You Don't Mess With A Feminist And Her Laptop": "", "History Books Take Note, Economics Is Definitely Not A Boys Club Anymore": "", "Basketball Fans Attacked A Couple For Being Too Gay. Now Enjoy The Best Protest Ever.": "", "Talk About Brave: Most People Would Have Run For The Hills, But These Medics Shine Under Pressure": "", "'One Of These Things Is Not Like The Others' Shouldn't Have Come To Mind When I Viewed A Class Photo": "", "WTF: Fox News Spends 4 Minutes Calling Wildly Successful Women Fat And Lazy": "", "There's Something Weird About These Familiar Children's Movies": "", "Everyone Should Know What This Cop Has Done": "", "Know A Girl Who’s Ever Felt Invisible? Please Show Her This.": "", "The Most Physically Damaging Thing Fox News Has Ever Done": "", "The Argument Against The Stop-And-Frisk Policy Gets An Upgrade Courtesy Of A Hip-Hop Icon": "", "The Cartoonish Joke That Is The Government Shutdown Explained In Less Than 4 Minutes": "", "The Truth About Angry Feminists": "", "The Most Amazing Act Of Heroism Ever Committed In Swim Trunks": "", "Man Lands In America, He Wasn't Born Here, But We Let Him Stay. Do You Know His Name?": "", "A Grown-Up Bully Bullies A Bunch Of Gay Teens To Stop Them From Stopping Bullying": "", "A Head-Slappingly Simple Strategy That Might Just Reduce The Crime Rate": "", "Few Things Are More Beautiful Than These 2 Women Singing These 22 Words": "", "With All The Junk Food Judgment We Pass Around, Ronald McDonald Is Still Making A Killing": "", "The Brutally Honest Coca-Cola Commercial You'll Never See On The Air": "", "One Of The Most Patriotic Things I've Ever Seen Doesn't Involve Guns, God, Or Glory": "", "His Dad Beat His Mom. He Tried To Stop Him. But He Was Only 5. So He's Speaking Out Now.": "", "If You Think Climate Change Is Boring, Watch This Video": "", "This Man Is Already Homeless. Now Some Idiot Has Made Him Even More Miserable.": "", "It Might Look Like A Bunch Of Scribbles, But It’s Actually Packed With Buckets Of Wisdom": "", "A Therapist Who Thinks He Can Cure Gay People Gets His Just Desserts, Care Of A Proud Gay Man": "", "How Does This Retail Giant Sleep At Night? After He Sees This, He Won't.": "", "Further Proof That Being Born A White Man Is A Bit Like Hitting The Lottery": "", "This Famous Actress Doesn't HAVE To Do This, But I'm So Glad She Is": "", "These People Committed Political Suicide For Gun Control. Guess Where They're NOT From.": "", "Even Though It's All About Women, The Men At The End Of The Video Inspire Me": "", "‘Dad, Did You Know Other Peoples’ Lives Are Different From Ours?’": "", "Watch A Musician Give The Coolest Science Lecture This Side Of Anywhere": "", "What Being 'One Of THOSE Girls' Means In America Today": "", "Oliver Stone Has Some Disturbing Questions He’d Like To Ask You": "", "Patton Oswalt's Tale Of Catastrophic Failure Is Hilarious. And Surprisingly Inspiring.": "", "Have You Been Seduced Into Screwing Everyone Else On The Planet?": "", "A Twist On A Grade School Song Tells Everything You Need To Know About The Terrifying Abortion Bill": "", "Meet A Guy Who Still Hasn’t Gotten The Memo About The 21st Century": "", "Little Boys Learn A Lot From Watching 'Star Wars,' And It Isn't All Good": "", "Who Knew That Callie And Arizona Making Out On 'Grey's Anatomy' Actually Helped Change The World?": "", "She Got Good Grades And Planned To Be A Doctor, So The U.S. Government Took The Next Logical Step": "", "Here’s The Ad That Muslims Across America Wish You Would See": "", "A Rihanna Song Just Got Remixed By These 3rd Graders. They Have A Message Every Parent Should Hear.": "", "You Might Recall The Old Song 'This Land Is Your Land.' But Do You Know Why It's Kinda Subversive?": "", "Are You Falling For The Biggest Trick Designed To Get Your Cash?": "", "I Just Learned How To Use A Paper Towel Properly For The First Time In My Life": "", "WTF! We Could Save Lives AND Money. Tell Me Again Why This Is A Problem?": "", "Would Mark Zuckerberg Have Your Back In An Internet Fistfight?": "", "The People Who Approved These Ads Have A Lot Of Explaining To Do": "", "With The Amount Of Infectious Goodness This Guy Keeps In His Car, It's No Wonder He's Gone Viral": "", "Everything About Him Screams Interesting. And Then He Speaks.": "", "If The Next Generation Seems A Bit More Amazing Than Usual, Blame Colbert": "", "Looks Like I've Found My New Favorite Fake Commercial": "", "Happens Every Time: Watching This Dude Kill It On The Dance Floor Makes My Heart Burst Open": "", "Maybe The Coolest Car Commercial You'll Ever See": "", "He Made A Choice. He Took A Life. He Made Another Choice. He's Saving A Community.": "", "One Girl Had A Mission To Show Everyone They Were Beautiful. Here's Her Story.": "", "An Awful Corporation Does Something So Cartoonishly Creepy That We Have To Make A Dr. Evil Reference": "", "Westboro Baptist Church May Have Met Their Match... And She's 5 Years Old": "", "It's Dangerous For Her To Get To School, But She's Doing It For Her Future": "", "Imagine The Most Graphic Horror Movie You've Ever Seen. ... This Is Worse.  And It's Real.": "", "The Unbelievable Loophole In U.S. Child Labor Law": "", "We Already Knew Costco Is A Great Company. Here's Something That Makes Them Fabulous.": "", "Do You Remember The Female Avenger? This Little Girl Does, And She Has Something To Say About It.": "", "I Have Seen Your Future Office Building. It Looks A Lot Like This.": "", "Stephen Colbert Wins Late Night Television With His Hilarious Critique Of Brad Paisley's Racist Song": "", "MUST WATCH: The Video CNBC Tried To Hide From The Internet. They Probably Shouldn't Have Done That.": "", "These Women Once Wanted To Shed Their Skin; You Won't Believe Their Reasoning.": "", "How Do You Know Someone Is Doing Something Awful? If They Call You A Terrorist For Photographing It.": "", "Do You Need To Yell At Your Congressperson? Check Out This Map To Find Out.": "", "Watch A Man Playing Piano In His House After The Floods For A Heartbreaking Reason": "", "Think We Haven’t Come A Long Way? Watch How Ridiculous Men Were Just 40 Years Ago.": "", "HALLELUJAH: Here Are All Of The Things I've Wanted To Yell Down The Self-Help Aisle": "", "Dashboard Camera Footage You’re Definitely Not Gonna See On ‘Cops’": "", "This Kid's Logic Will Make You ​​Delete 'Candy Crush' From Your Phone And Hand Over Your Socks": "", "What An Orangutan Says To This Little Girl Is A Message We All Need To Know About": "", "I Used To Kill Ants With A Magnifying Glass. This Guy Does The Same Thing, But Much Worse.": "", "Meet The Horrifying Demon That Has Crept Into Our School System": "", "Doctors Told Sam He Had Until He Was 13. He's Almost 17. Here’s How He's Fighting.": "", "The Craigslist Ad That Will Make The Government Shutdown Seem Hilarious": "", "When Trying To Make A Living Turned Into A Nightmare, This Woman Changed It Back Into A Dream": "", "You Will Not Believe What It Cost The NRA To Make Sure Background Checks Got Killed": "", "Jon Stewart Shows A President How To Shake Them Haters Off": "", "Here's Why You Should Always Sit Through The End Of A Will Ferrell Movie": "", "See How One Couple Squeezes An Entire Farm Onto Their Small Los Angeles Property": "", "The One Where A Retired Congressman Speaks Common Sense On NBC And There's Dead Silence": "", "Watch This Tiny Badass Kick The Crap Out Of One Of A Million Hurdles Placed In His Way": "", "A Woman With A Great Mind Asks You To Take A Moment To Appreciate Her Body": "", "Meet The Two 8-Year-Olds Who Aren't Letting Anything Hold Them Back": "", "What’s The Most Quietly Despised One-Fifth Of America Nobody’s Talking About?": "", "NOT A GOOD LOOK: A Notoriously Loudmouth Celeb All Of A Sudden Goes Silent": "", "The Classy Way To Take On People Who Hate You": "", "The Only Thing ‘Unnatural’ About Gay Marriage Is That There Aren’t Enough Ads Out There Like This": "", "FUN APOCALYPSE: Why Would You Take This OUT Of The Classroom?": "", "What World Do We Live In When Even An Act Of Kindness Faces This Kind of Discrimination?": "", "How Al Gore Could Have Won The 2000 Presidential Election With Ease": "", "Nice Try Banning This Advert, Rupert Murdoch, But Australia Can Watch It Here Instead": "", "What If We Could Harness The Power Of A Song Getting Stuck In Your Head?": "", "1 Key Difference Between Being Gay And Trying To Poison Your Neighbor’s Cat": "", "Representative Brian Sims Brings The House Down With A Single Sentence About Abortion": "", "What They're Trying To Do To This Man Is Rough, But What He Says At The End Is Devastating": "", "Behold The Bluntest, Deepest, And Deadliest Graduation Speech In The History Of The Known Universe": "", "It's Rare That The Daily Show Slips Out Of Satire And Into Anger. This Is One Of Those Times.": "", "Here's The First Marriage Proposal On TV After Love Was Ruled Constitutional. You're Welcome.": "", "MUST WATCH: The Pollution-Free, Air-Powered Car That’s Telling A Whole Industry To Go Kiss Its ‘Gas’": "", "117 Miles Per Gallon: In Your FACE, Prius!": "", "The Warning Label That We Never Knew We Needed Until We Saw It": "", "Here's How Telling Your Black Friends They're 'Not Really Black' Gets You Made Fun Of On Television": "", "Did You Know Babies Could Commit Crimes? These Folks Didn't Either.": "", "This Is Why I’m Afraid Of My Couch": "", "A Soul Mate Is Waiting As Long As You're OK With Bending The Rules A Bit": "", "A Disney Princess​ Sings About Men — Not A Love Song, But One That I Want All Little Girls To Hear": "", "A Father Reprimands His Homophobic Child In This Beautiful Letter": "", "A Holocaust Survivor's Compassionate Message To Germans": "", "I Got 99 Problems, But My Periodic Table Ain’t One": "", "The Real Cost Of The Tea Party's Shenanigans In One Horrifying Graphic": "", "Bette Midler Didn’t Know This Was Going To Be Caught On Tape. That Makes This Even More Amazing.": "", "Every Night This Dad Falls Asleep In Front Of The TV. There's A Beautiful Reason Why.": "", "You Won’t Believe What The Chinese Government Did To These 26 Million Children": "", "Conan O'Brien Does Some Investigative Journalism. The Result Is Hilarious.": "", "Is There Even A 'Right' Way To React When Your Dad Tells You He's Gay?": "", "When You Have Common Sense Like This Guy, Who Needs To Argue With Homophobes?": "", "You Won't Believe This Video Was Shot In America": "", "In Case You Missed It, Here's When It's OK For Boys To Play With Dolls And Girls To Play With Cars": "", "Elizabeth Warren Asks The Most Obvious Question Ever And Stumps A Bunch Of Bank Regulators": "", "The Debt Ceiling: Like The 'Stop Hitting Yourself' Game, But With The Global Economy": "", "You Know How People Say Everyone In America Should Speak English? How About This American Language?": "", "Can You Imagine Getting Up In Front Of The Entire World And Giving This Speech?": "", "'The Hunger Games' Are Here. And They Are Very, Very Real.": "", "A Bunch Of Bullies Thought It Would Be Funny To Pummel This Kid. They Aren't Laughing Now.": "", "WTF: How A Trainer On NBC's 'The Biggest Loser' Gave One Contestant An Eating Disorder": "", "Meet Anthony. He’s About To Educate Us On One Of The Most Perplexing And Obvious Signs Of Autism.": "", "Nobody Knows About This Little Town, But You Should Before It's Literally Wiped Off The Map Forever": "", "Remember How Shocking It Was When Ellen Came Out On TV? Look How Far We’ve Come Since Then.": "", "A Rapper Just Used His Music Video To Tell The World Something He's Had To Hide Until Now": "", "Geraldo Rivera Surprises Fox News By Destroying Anti-Gun Control Arguments": "", "Simplest Description of PTSD Ever Told In 2 And Half Minutes": "", "10 Reasons Why Global Warming Is A BIG FAKE": "", "Think You Know What Food Stamps Can Buy? You Might Be Surprised...": "", "All Right, Internet, You Got Me. I'm Inspired By This Dude.": "", "I Wouldn't Mind Getting Sent To This Principal's Office": "", "Disney Just Pissed Off The Wrong Group Of People": "", "This Father's Love For His Kids Is Beautiful. What Happened To Him Has Me Embarrassed As An American.": "", "I Went Looking For A Serious Discussion About Gun Safety, And All I Got Was This Video": "", "Why The Government Wants You To Be Ready For Zombies": "", "CHART: Why Nearly Half Of Today's Kids Won't Be Able To Look At Their Parents' Wedding Photos": "", "Turns Out You Can Use Twitter For Something Other Than Cat Memes And Instagram Selfies": "", "So Let's Have It — Are You Team Elephant Or Team Hummingbird?": "", "She's Fierce. She's Blunt. And Sadly, She's Also Right.": "", "For 13 Years, These Boys' Lives Were Filmed. The Result Is Better Than Any Reality Show I've Seen.": "", "NAILED IT: Watch A Really Smart Comedian Destroy A Really Dumb Idea": "", "This Teenage Girl Just Took High School Science Fairs To A WHOLE New Level": "", "An Awkward Kid Grows Up Into A Force Of Nature With A Wonderfully Positive Message": "", "She Had One Year To Live, And This Is How She Did It": "", "How A Heartless Man Inspired The World": "", "We Don't Teach Kids German In Gym Class, So Why On Earth Would We Teach This In Biology Class?": "", "After Such A God-Awful War, This Moment Deserves An ABOUT DAMN TIME": "", "What Goes Through A Soldier’s Mind During An Attack? Might Not Be What You Expect.": "", "Dumbledore Is Gay. Harry Potter Has This To Say.": "", "This MIT Professor Has Her Sassy Pants On, And She's Not Letting Mark Zuckerberg Off The Hook": "", "50 Shades Of Wrong: Why You're Way More Likely To Get Arrested At The End Of An Officer's Shift": "", "The Dirty Little Secret That Fast-Food Companies Don't Want You To Know": "", "This Adorable Kid Just Wants To Take A Girl On A Date. So Why Is That Such A Big Deal?": "", "NBA Superstar Calls Out His Fans For Lobbing Homophobic Insults On Twitter": ""}